{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8a9bfd96",
   "metadata": {},
   "source": [
    "<img width=500 src=\"Imagenes/Assembler.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f1adf8a7",
   "metadata": {},
   "source": [
    "                                        Individual Project No-SQL databases\n",
    "                                        \n",
    "                                        \n",
    "## Introduction\n",
    "\n",
    "The Data bases are the best tool to store information, and according on how we would like to store this information (just like many tables pointing to the same study, or simply keeping the variability of the fields on each record without having to store a lot of null values, etc) some kinds of data bases are more effective than others. There are many application that allow to manage and handle data base for each type of data base but the interaction of these data when it needs to go from a database type to another could be \"annoying\", that's why in this project we will try to interact with  none structured data base from a central notebook connected to local servers of Neo4j and MongoDB data bases manager systems, and in an additional section, will connect and manipulate a new and larger data base  with MySQL to extend the initial mondoDB dataset, and then perform a brief data behavior analysis through the MongoDB charts utility with this data exported to a cluster"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9933eaba",
   "metadata": {},
   "source": [
    "# Connecting Jupyter to Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad8b5a6d",
   "metadata": {},
   "source": [
    "This part of the notebook is intended to group and keep recorded all  individual project's  neo4j proposed queries, performed from local neo4j desktop app.\n",
    "If other neo4j app would be used to perform (for example neo4j sandbox), the Bolt URL may change.\n",
    "Also your Jupyter notebook need to be able to connect with neo4j through the neo4j's driver.\n",
    "Neo4j instal available running: (Copy, paste and run in a code cell the line below)\n",
    "\n",
    ".\n",
    "`!pip install neo4j`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "0a167f5d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "url= \"bolt://localhost:7687\"                                \n",
    "pwd= \"12345678\"                                             #This password may change (it is setted by each user at the creation of the neo4j project), be sure you typed yours\n",
    "driver = GraphDatabase.driver(url, auth=(\"neo4j\",pwd))      #Both Bolt URL and password are setted for the localhost connection and to get wholes access to the databases"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b4bdcc6",
   "metadata": {},
   "source": [
    "The dbms_create function must be executed  due that this data base will contain the data and where the consultant queries will be performed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "53aa8b24",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dbms_create(DBMS):\n",
    "    ''' Creates a data base in the neo4j project folder, by input the arbitrary database name'''\n",
    "    proceed=False          \n",
    "    while proceed==False:\n",
    "        with driver.session() as session:\n",
    "            try:\n",
    "                query = session.run(f\"CREATE DATABASE {DBMS}\").single()\n",
    "                proceed = True\n",
    "            except Exception as e:\n",
    "                print (e)\n",
    "            return query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3338dc72",
   "metadata": {},
   "source": [
    "The query function must be executed every time we want to do a query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "930d7193",
   "metadata": {},
   "outputs": [],
   "source": [
    "def query(sentence):\n",
    "    f'''Query performs any neo4j sentence at the {DBMS} data base, by input the query sentence as input argument'''\n",
    "    proceed=False            #    through this condition          \n",
    "    while proceed==False:\n",
    "        with driver.session() as session:\n",
    "            try:\n",
    "                query = session.run(f'''USE {DBMS}\\n{sentence}''').single()\n",
    "                proceed = True\n",
    "            except Exception as e:\n",
    "                print (e)\n",
    "            return query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1aaf771c",
   "metadata": {},
   "source": [
    "## Creating the data base"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a5eb3bee",
   "metadata": {},
   "outputs": [],
   "source": [
    "DBMS= \"`Neo4jProject`\"      # `Neo4jProject` is an arbitrary title, setted by the user\n",
    "result= dbms_create(DBMS)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d30614bb",
   "metadata": {},
   "source": [
    "## Performing Neo4j proposed queries \n",
    "Create a graph in which we represent a series of courses and students, where students are associated with courses through a realize type relationship"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "18bb8a4e",
   "metadata": {},
   "source": [
    "### Creating nodes and relationships"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "502b70e8",
   "metadata": {},
   "source": [
    "#### Course labeled nodes\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "ecdd4b6b",
   "metadata": {},
   "outputs": [],
   "source": [
    "sentence= '''\n",
    "CREATE (java:Course{name: \"Standard Java Programming\", duration: 120, price: 80})\n",
    "CREATE (angular:Course{name: \"Angular\", duration: 30, price: 110})\n",
    "CREATE (spring:Course{name: \"Spring\", duration: 80, price: 200})\n",
    "'''\n",
    "result= query(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "83db4dea",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/course_nodes.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4b294a53",
   "metadata": {},
   "source": [
    "#### Course labeled nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "0ee56efd",
   "metadata": {},
   "outputs": [],
   "source": [
    "sentence= '''\n",
    "CREATE (pepe:Student{name: \"Pepe\", age: 20})\n",
    "CREATE (ana:Student{name: \"Ana\", age: 40})\n",
    "CREATE (elena:Student{name: \"Elena\", age: 34})\n",
    "CREATE (mario:Student{name: \"Mario\", age: 19})\n",
    "'''\n",
    "result= query(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e305a555",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/courses_n_students.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f388b721",
   "metadata": {},
   "source": [
    "#### Setting up relationships between students and courses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "1328f883",
   "metadata": {},
   "outputs": [],
   "source": [
    "sentence= '''\n",
    "MATCH (pepe {name:\"Pepe\"}),(ana {name:\"Ana\"}),(elena {name:\"Elena\"}),(mario {name:\"Mario\"}),(java {name:\"Standard Java Programming\"}),(angular {name:\"Angular\"}),(spring {name:\"Spring\"})\n",
    "CREATE\n",
    "(pepe)-[:PERFORMS {schedule:\"Morning\"}]->(java),\n",
    "(pepe)-[:PERFORMS {schedule:\"Afternoon\"}]->(angular),\n",
    "(elena)-[:PERFORMS {schedule:\"Afternoon\"}]->(java),\n",
    "(ana)-[:PERFORMS {schedule:\"Morning\"}]->(angular),\n",
    "(mario)-[:PERFORMS {schedule:\"Morning\"}]->(spring)\n",
    "'''\n",
    "result= query(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "984c0c04",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/match_n_return_n.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6a9e89fc",
   "metadata": {},
   "source": [
    "### Consulting queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5712a2a9",
   "metadata": {},
   "source": [
    "#### Show the name of the students who take courses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5d18b31c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record collect(DISTINCT n.name)=['Pepe', 'Elena', 'Ana', 'Mario']>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Student)-[:PERFORMS]->(:Course)\n",
    "RETURN collect(DISTINCT n.name)'''\n",
    "result= query(sentence)\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9845f96e",
   "metadata": {},
   "source": [
    "#### Search for the spring course"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "365197d7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record spring=<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:9' labels=frozenset({'Course'}) properties={'duration': 80, 'price': 200, 'name': 'Spring'}>>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (spring{name:\"Spring\"})\n",
    "RETURN spring'''\n",
    "result= query(sentence)\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "01dcf87b",
   "metadata": {},
   "source": [
    "#### Show the courses that Pepe takes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "76202071",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record collect( DISTINCT course.name)=['Angular', 'Standard Java Programming']>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (pepe:Student{name:\"Pepe\"})-[:PERFORMS]->(course:Course)\n",
    "RETURN collect( DISTINCT course.name)'''\n",
    "result= query(sentence)\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9197e5e",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/graph2.3.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "64295282",
   "metadata": {},
   "source": [
    "#### Show Pepe's data and the number of courses where he has enrolled"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "81230d11",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record Pepe_info=<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:10' labels=frozenset({'Student'}) properties={'name': 'Pepe', 'age': 20}> Courses_Enrolled=2>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (pepe:Student{name:\"Pepe\"})-[:PERFORMS]->(course:Course)\n",
    "WITH count(course) as Courses_Enrolled, pepe as Pepe_info\n",
    "RETURN Pepe_info, Courses_Enrolled'''\n",
    "result= query(sentence)\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "663a6888",
   "metadata": {},
   "source": [
    "#### Show the name and the total number of the students who take the angular course "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "cbaef877",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record Angular_Students=['Ana', 'Pepe'] Angular_Nstudents=2>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Student)-[:PERFORMS]->(course:Course{name:\"Angular\"})\n",
    "WITH collect(n.name) as Angular_Students, count(n) as Angular_Nstudents\n",
    "RETURN Angular_Students, Angular_Nstudents'''\n",
    "result= query(sentence)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "801f0959",
   "metadata": {},
   "source": [
    "#### Modify Ana's age from 40 to 25 years and then show the person whose age  is 25"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "1c40f994",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:11' labels=frozenset({'Student'}) properties={'name': 'Ana', 'age': 25}>>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Student)\n",
    "WHERE n.name=\"Ana\"\n",
    "SET n.age=25\n",
    "WITH n as n\n",
    "WHERE n.age = 25\n",
    "RETURN n'''\n",
    "result= query(sentence)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3ff3431d",
   "metadata": {},
   "source": [
    "#### Show all ages of students"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "864df1f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record collect(n.age)=[20, 25, 34, 19]>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Student)\n",
    "RETURN collect(n.age)'''\n",
    "result= query(sentence)\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eb0c7a1d",
   "metadata": {},
   "source": [
    "#### Show the price of all courses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "1fe43556",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record collect(n.price)=[80, 110, 200]>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Course)\n",
    "RETURN collect(n.price)'''\n",
    "result= query(sentence)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eb71d5d6",
   "metadata": {},
   "source": [
    "#### Discard Mario"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "8cb57dc8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (mario:Student{name:\"Mario\"})\n",
    "DETACH DELETE mario'''\n",
    "result= query(sentence)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef48a791",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/graph2.9.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9c165bd",
   "metadata": {},
   "source": [
    "#### Obtain the maximum and minimum age and the sum of students"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "50b3b82a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record Student_MaxAge=34 Student_MinAge=20>\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (n:Student)\n",
    "WITH max(n.age) as Student_MaxAge, min(n.age) as Student_MinAge\n",
    "RETURN Student_MaxAge, Student_MinAge'''\n",
    "result= query(sentence)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9531c13b",
   "metadata": {},
   "source": [
    "#### Modify the relationship Pepe and Java relationship, since it happens to perform it in the afternoon"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "0326d6b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:10' labels=frozenset({'Student'}) properties={'name': 'Pepe', 'age': 20}>]\n",
      "[<Relationship element_id='5:755b4880-058e-4f88-a384-417f9d62c057:5' nodes=(<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:10' labels=frozenset({'Student'}) properties={'name': 'Pepe', 'age': 20}>, <Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:7' labels=frozenset({'Course'}) properties={'duration': 120, 'price': 80, 'name': 'Standard Java Programming'}>) type='PERFORMS' properties={'schedule': 'Afternoon'}>]\n",
      "[<Node element_id='4:755b4880-058e-4f88-a384-417f9d62c057:7' labels=frozenset({'Course'}) properties={'duration': 120, 'price': 80, 'name': 'Standard Java Programming'}>]\n"
     ]
    }
   ],
   "source": [
    "sentence= '''\n",
    "MATCH (a:Student{name:\"Pepe\"})-[r:PERFORMS]->(b:Course{name:\"Standard Java Programming\"})\n",
    "SET r.schedule = \"Afternoon\"\n",
    "RETURN collect(a),collect(r),collect(b)'''\n",
    "result= query(sentence)\n",
    "for cursor in result:\n",
    "    print(cursor)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0df9b05",
   "metadata": {},
   "source": [
    "<img width=350 src=\"Imagenes/graph2.11.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "88ba7816",
   "metadata": {},
   "source": [
    "#### Remove the tree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "16a48b25",
   "metadata": {},
   "outputs": [],
   "source": [
    "sentence= '''MATCH (n)\n",
    "DETACH DELETE n'''\n",
    "result= query(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d2c77c73",
   "metadata": {},
   "source": [
    "# Connecting Jupyter to MongoDB "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dcf75f56",
   "metadata": {},
   "source": [
    "This part of the notebook is intended to group and keep recorded all  individual project's  mongoDB proposed queries, performed from mongodb localhost (mongodb compass).\n",
    "If other mongoDB app would be used to perform (for example mongoDB Atlas), connection parameters could change.\n",
    "Also your Jupyter notebook need to be able to connect with mongodb localhost through Pymongo, available running the code: (Copy, paste and run in a code cell the line below)\n",
    "\n",
    ".\n",
    "`!pip install pymongo`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "84e073ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pymongo\n",
    "from pymongo import MongoClient"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a92e211",
   "metadata": {},
   "source": [
    "## Creating the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "731f19be",
   "metadata": {},
   "outputs": [],
   "source": [
    "client = MongoClient(\"localhost\", 27017)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "12cf82d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "db = client[\"MongoProject\"]\n",
    "movies = db[\"movies\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "be86cad9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dispQuery(sentence):\n",
    "    '''Take the resultant query and iterates over the cursor position to print the results. By input the sentence'''\n",
    "    for cursor in sentence:\n",
    "        print(cursor,\"\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "420485f4",
   "metadata": {},
   "source": [
    "### Insert the following documents into a collection called `movies`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "86343d43",
   "metadata": {},
   "outputs": [],
   "source": [
    "movies.insert_many([\n",
    "{\n",
    "\"title\" : \"Fight Club\",\n",
    "\"Writer\": \"Chuck Palahniuk\",\n",
    "\"Year\": 1999,\n",
    "\"actors\": [\"Brad Pitt\",\"Edward Norton\"]\n",
    "},\n",
    "{\n",
    "\"title\": \"Pulp Fiction\",\n",
    "\"writer\": \"Quentin Tarantino\",\n",
    "\"year\" : 1994,\n",
    "\"actors\" : [\"John Travolta\",\"Uma Thurman\"]\n",
    "},\n",
    "{\n",
    "\"title\" : \"Inglorious Basterds\",\n",
    "\"writer\": \"Quentin Tarantino\",\n",
    "\"year\" : 2009,\n",
    "\"actors\" : [\"Brad Pitt\",\"Diane Kruger\",\"Eli Roth\"]\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: An Unexpected Journey\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2012,\n",
    "\"franchise\" : \"The Hobbit\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: The Desolation of Smaug\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2013,\n",
    "\"franchise\" : \"The Hobbit\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: The Battle of the Five Armies\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2012,\n",
    "\"franchise\" : \"The Hobbit\",\n",
    "\"Synopsis\": \"Bilbo and Company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness.\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"Pee Wee Herman's Big Adventure\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"Avatar\"\n",
    "}\n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d32a4b63",
   "metadata": {},
   "source": [
    "## Performing proposed MongoDB queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3496aed1",
   "metadata": {},
   "source": [
    "### Get all the documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "a080d6be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'_id': ObjectId('648846c14186da8a68dcdf3d'), 'title': 'Fight Club', 'Writer': 'Chuck Palahniuk', 'actors': ['Brad Pitt', 'Edward Norton'], 'year': 1999} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf3e'), 'title': 'Pulp Fiction', 'writer': 'Quentin Tarantino', 'year': 1994, 'actors': ['John Travolta', 'Uma Thurman']} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf3f'), 'title': 'Inglorious Basterds', 'writer': 'Quentin Tarantino', 'year': 2009, 'actors': ['Brad Pitt', 'Diane Kruger', 'Eli Roth']} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf40'), 'title': 'The Hobbit: An Unexpected Journey', 'writer': 'J.R.R. Tolkien', 'year': 2012, 'franchise': 'The Hobbit'} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf41'), 'title': 'The Hobbit: The Desolation of Smaug', 'writer': 'J.R.R. Tolkien', 'year': 2013, 'franchise': 'The Hobbit'} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf42'), 'title': 'The Hobbit: The Battle of the Five Armies', 'writer': 'J.R.R. Tolkien', 'year': 2012, 'franchise': 'The Hobbit', 'Synopsis': 'Bilbo and Company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness.'} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf43'), 'title': \"Pee Wee Herman's Big Adventure\"} \n",
      "\n",
      "{'_id': ObjectId('648846c14186da8a68dcdf44'), 'title': 'Avatar'} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sentence = movies.find({})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "55616127",
   "metadata": {},
   "source": [
    "### Get documents with `writer` equal to \"Quentin Tarantino\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "179bb737",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'Pulp Fiction', 'writer': 'Quentin Tarantino', 'year': 1994, 'actors': ['John Travolta', 'Uma Thurman']} \n",
      "\n",
      "{'title': 'Inglorious Basterds', 'writer': 'Quentin Tarantino', 'year': 2009, 'actors': ['Brad Pitt', 'Diane Kruger', 'Eli Roth']} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sentence = movies.find({\"writer\":\"Quentin Tarantino\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "916ffa26",
   "metadata": {},
   "source": [
    "### Get documents with `actors` that include \"Brad Pitt\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "e6010499",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'Fight Club', 'Writer': 'Chuck Palahniuk', 'actors': ['Brad Pitt', 'Edward Norton'], 'year': 1999} \n",
      "\n",
      "{'title': 'Inglorious Basterds', 'writer': 'Quentin Tarantino', 'year': 2009, 'actors': ['Brad Pitt', 'Diane Kruger', 'Eli Roth']} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sentence= movies.find({\"actors\":\"Brad Pitt\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cdcac5d9",
   "metadata": {},
   "source": [
    "### Get documents with `franchise` equal to \"The Hobbit\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7b71c873",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'The Hobbit: An Unexpected Journey', 'writer': 'J.R.R. Tolkien', 'year': 2012, 'franchise': 'The Hobbit', 'synopsis': 'A reluctant hobbit, Bilbo Baggins, sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain home - and the gold within it - from the dragon Smaug.'} \n",
      "\n",
      "{'title': 'The Hobbit: The Desolation of Smaug', 'writer': 'J.R.R. Tolkien', 'year': 2013, 'franchise': 'The Hobbit', 'synopsis': 'The dwarves, along with Bilbo \\nBaggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. \\nBilbo Baggins is in possession of a mysterious and magical ring.'} \n",
      "\n",
      "{'title': 'The Hobbit: The Battle of the Five Armies', 'writer': 'J.R.R. Tolkien', 'year': 2012, 'franchise': 'The Hobbit', 'Synopsis': 'Bilbo and Company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness.'} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sentence=movies.find({\"franchise\":\"The Hobbit\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53b18fad",
   "metadata": {},
   "source": [
    "### Get all the 90s movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "a43d608c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'Fight Club', 'year': 1999} \n",
      "\n",
      "{'title': 'Pulp Fiction', 'year': 1994} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "#Renaming the collection's field#\n",
    "movies.update_one({\"title\": \"Fight Club\"}, {\"$rename\": {\"Year\":\"year\"}})\n",
    "#Finding 90's movies#\n",
    "sentence = movies.aggregate([\n",
    "{\"$match\": \n",
    "{\"$and\":\n",
    "[\n",
    "\t{\"year\": {\"$gte\": 1990}},\n",
    "\t{\"year\": {\"$lt\": 2000}}\n",
    "]\n",
    "}},\n",
    "  {\"$project\": {\"_id\":0, \"title\":1, \"year\":1}}\n",
    "])\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "835018fc",
   "metadata": {},
   "source": [
    "### Obtain the films released between the year 2000 and 2010"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "4a22b2c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'Inglorious Basterds', 'year': 2009} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sentence = movies.aggregate([\n",
    "{\"$match\": \n",
    "{\"$and\":\n",
    "[\n",
    "\t{\"year\": {\"$gte\": 2000}},\n",
    "\t{\"year\": {\"$lte\": 2010}}\n",
    "]\n",
    "}},\n",
    "  {\"$project\": {\"_id\":0, \"title\":1, \"year\":1}}\n",
    "])\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bcddbbe1",
   "metadata": {},
   "source": [
    "### Update Documents 1\n",
    "Add synopsis to \"The Hobbit: An Unexpected Journey\" : \"A reluctant hobbit, Bilbo Baggins,\n",
    "sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain\n",
    "home - and the gold within it - from the dragon Smaug .\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "2c2b9d85",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'The Hobbit: An Unexpected Journey', 'writer': 'J.R.R. Tolkien', 'year': 2012, 'franchise': 'The Hobbit', 'synopsis': 'A reluctant hobbit, Bilbo Baggins, sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain home - and the gold within it - from the dragon Smaug.'} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "movies.update_one({\"title\": \"The Hobbit: An Unexpected Journey\"},{\"$set\": {\"synopsis\": \"A reluctant hobbit, Bilbo Baggins, sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain home - and the gold within it - from the dragon Smaug.\"}})\n",
    "sentence = movies.find({\"title\":\"The Hobbit: An Unexpected Journey\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c4b7d72",
   "metadata": {},
   "source": [
    "### Update Documents 2\n",
    "Add synopsis to \"The Hobbit: The Desolation of Smaug\" : \"The dwarves, along with Bilbo\n",
    "Baggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from\n",
    "Smaug. Bilbo Baggins is in possession of a mysterious and magical ring.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "b0b4100c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'The Hobbit: The Desolation of Smaug', 'writer': 'J.R.R. Tolkien', 'year': 2013, 'franchise': 'The Hobbit', 'synopsis': 'The dwarves, along with Bilbo \\nBaggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. \\nBilbo Baggins is in possession of a mysterious and magical ring.'} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "movies.update_one({\"title\": \"The Hobbit: The Desolation of Smaug\"},{\"$set\": {\"synopsis\": '''The dwarves, along with Bilbo Baggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. Bilbo Baggins is in possession of a mysterious and magical ring.'''}})\n",
    "sentence = movies.find({\"title\": \"The Hobbit: The Desolation of Smaug\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f9043d87",
   "metadata": {},
   "source": [
    "### Update Documents 3\n",
    "Adding an actor named \"Samuel L. Jackson\" to the movie \"Pulp Fiction\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "4a704ace",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'title': 'Pulp Fiction', 'writer': 'Quentin Tarantino', 'year': 1994, 'actors': ['John Travolta', 'Uma Thurman', 'Samuel L. Jackson']} \n",
      "\n"
     ]
    }
   ],
   "source": [
    "movies.update_one({\"title\": \"Pulp Fiction\"},{\"$set\": {\"actors.2\": \"Samuel L. Jackson\"}})\n",
    "sentence= movies.find({\"title\": \"Pulp Fiction\"},{\"_id\":0})\n",
    "dispQuery(sentence)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "778148bc",
   "metadata": {},
   "source": [
    "# Additional tasks\n",
    ".\n",
    "1.- Connecting Jupyter to MySQL\n",
    "\n",
    ".\n",
    "2.- MongoDB Data base analysis "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d7a29f80",
   "metadata": {},
   "source": [
    "This part of the notebook is intended to use csv files to extend the mongoDB data base and then develop a brief analysis report of the data, handling these csv files through local MySQL.\n",
    "\n",
    ".\n",
    "`!pip install mysqlclient`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c9290f3c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import MySQLdb\n",
    "conn = MySQLdb.connect(                       # The local connection to MySQL get established,       \n",
    "    host=\"localhost\",                         # the sql server must be active to connect successfully.  \n",
    "    user=\"root\",                              # The connection parameters may vary according with those setted when \n",
    "    password=\"\"                               # the MySQL local server was created\n",
    "    )\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "582cca76",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_sql (nombre_base_datos):\n",
    "    '''Creates a database at MySql, by input the database arbitrary name'''\n",
    "    cursor = conn.cursor()\n",
    "    try:   \n",
    "        cursor.execute(f\"CREATE DATABASE {nombre_base_datos}\")\n",
    "        conn.commit()                                                    # The commit confirms the previous modification \n",
    "        print(f\"Database '{nombre_base_datos}' has been created successfully.\")\n",
    "\n",
    "    except MySQLdb.Error as error:\n",
    "        print(f\"Cannot create the database: {error}\")\n",
    "    cursor.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "4a47e0d3",
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_sql (sentence):\n",
    "    '''Performs queries at MySql, by input the MySQL query sentence and returns the result of the query'''\n",
    "    \n",
    "    cursor = conn.cursor()                     # The cursor will act as the handler and will mediate betweem \n",
    "    query = cursor.execute(sentence)           # python and MySQL                             \n",
    "    results = cursor.fetchall()\n",
    "    cursor.close()                               \n",
    "    return results                                      "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c127efc",
   "metadata": {},
   "source": [
    "## Creation of a new data base\n",
    "A new database created in local MySQL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "21c03752",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database 'NoSQL_ProjectExt' has been created successfully.\n"
     ]
    }
   ],
   "source": [
    "nombre_base_datos = 'NoSQL_ProjectExt'                           \n",
    "create_sql (nombre_base_datos)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bcc7fa4d",
   "metadata": {},
   "source": [
    "## Creation of new tables and importing data from CSV\n",
    "To extend the `movies` mongo database, the movies, actors and directors will be created, and then joined into one single table, that will be exported as a JSON file and then will be merged with the mongo data base to be analysed through some mongo charts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "db7d6317",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# movies' table creation\n",
    "\n",
    "query = f'''USE {nombre_base_datos};\n",
    "CREATE TABLE movies(\n",
    "    title varchar(255),\n",
    "    released varchar (255),\n",
    "    tagline varchar(255)\n",
    ");'''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "id": "3e5eda3c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# movies' data filling by importing from a CSV\n",
    "query = f'''LOAD DATA INFILE \"C:/Users/34666/Master Data Scientist/Modulo III/NoSQL Individual Project/movies.csv\"\n",
    "INTO TABLE movies\n",
    "FIELDS TERMINATED BY \",\"\n",
    "IGNORE 1 ROWS; '''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "id": "49c705ef",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 124,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# actors' table creation\n",
    "\n",
    "query = f'''USE {nombre_base_datos};\n",
    "CREATE TABLE actors(\n",
    "    movie_title varchar(255),\n",
    "    role varchar(255),\n",
    "    name varchar (255),\n",
    "    born varchar (255)\n",
    ");'''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "id": "9e3c7cb7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 125,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# actors' data filling by importing from a CSV\n",
    "query = f'''LOAD DATA INFILE \"C:/Users/34666/Master Data Scientist/Modulo III/NoSQL Individual Project/actors.csv\"\n",
    "INTO TABLE ACTORS\n",
    "FIELDS TERMINATED BY \",\"\n",
    "IGNORE 1 ROWS; '''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "f67e537b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# actors' table creation\n",
    "\n",
    "query = f'''USE {nombre_base_datos};\n",
    "CREATE TABLE directors(\n",
    "    movie_title varchar(255),\n",
    "    name varchar(255),\n",
    "    born varchar (255)\n",
    ");'''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "id": "edf247c8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "()"
      ]
     },
     "execution_count": 127,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# directors' data filling by importing from a CSV\n",
    "query = f'''LOAD DATA INFILE \"C:/Users/34666/Master Data Scientist/Modulo III/NoSQL Individual Project/directors.csv\"\n",
    "INTO TABLE DIRECTORS\n",
    "FIELDS TERMINATED BY \",\"\n",
    "IGNORE 1 ROWS; '''\n",
    "query_sql (query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "id": "b21d8155",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "('Johnny Mnemonic', '1995', 'The hottest data on earth. In the coolest head in town\\r')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "(\"The Devil's Advocate\", '1997', 'Evil has its winning ways\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('The Matrix Revolutions', '2003', 'Everything that has a beginning has an end\\r')\n",
      "('The Matrix Reloaded', '2003', 'Free your mind\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('The Matrix', '1999', 'Welcome to the Real World\\r')\n",
      "('That Thing You Do', '1996', 'In every life there comes a time when that thing you dream becomes that thing you do\\r')\n",
      "(\"The Devil's Advocate\", '1997', 'Evil has its winning ways\\r')\n",
      "(\"The Devil's Advocate\", '1997', 'Evil has its winning ways\\r')\n",
      "(\"The Devil's Advocate\", '1997', 'Evil has its winning ways\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "(\"One Flew Over the Cuckoo's Nest\", '1975', '\"If he\\'s crazy')\n",
      "('Hoffa', '1992', \"He didn't want law. He wanted justice.\\r\")\n",
      "('As Good as It Gets', '1997', 'A comedy from the heart that goes for the throat.\\r')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('As Good as It Gets', '1997', 'A comedy from the heart that goes for the throat.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('Hoffa', '1992', \"He didn't want law. He wanted justice.\\r\")\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('A Few Good Men', '1992', '\"In the heart of the nation\\'s capital')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('Joe Versus the Volcano', '1990', '\"A story of love')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Top Gun', '1986', '\"I feel the need')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Jerry Maguire', '2000', 'The rest of his life begins now.\\r')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('RescueDawn', '2006', \"Based on the extraordinary true story of one man's fight for freedom\\r\")\n",
      "('Stand By Me', '1995', '\"For some')\n",
      "('Cast Away', '2000', '\"At the edge of the world')\n",
      "('Twister', '1996', \"Don't Breathe. Don't Look Back.\\r\")\n",
      "('As Good as It Gets', '1997', 'A comedy from the heart that goes for the throat.\\r')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('As Good as It Gets', '1997', 'A comedy from the heart that goes for the throat.\\r')\n",
      "('As Good as It Gets', '1997', 'A comedy from the heart that goes for the throat.\\r')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('Snow Falling on Cedars', '1999', 'First loves last. Forever.\\r')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('RescueDawn', '2006', \"Based on the extraordinary true story of one man's fight for freedom\\r\")\n",
      "('Bicentennial Man', '1999', \"One robot's 200 year journey to become an ordinary man.\\r\")\n",
      "('The Birdcage', '1996', 'Come as you are\\r')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('What Dreams May Come', '1998', 'After life there is more. The end is just the beginning.\\r')\n",
      "('Snow Falling on Cedars', '1999', 'First loves last. Forever.\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('Snow Falling on Cedars', '1999', 'First loves last. Forever.\\r')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('Snow Falling on Cedars', '1999', 'First loves last. Forever.\\r')\n",
      "('Snow Falling on Cedars', '1999', 'First loves last. Forever.\\r')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('RescueDawn', '2006', \"Based on the extraordinary true story of one man's fight for freedom\\r\")\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('The Polar Express', '2004', 'This Holiday Season… Believe\\r')\n",
      "(\"Charlie Wilson's War\", '2007', \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\\r\")\n",
      "('Cast Away', '2000', '\"At the edge of the world')\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('That Thing You Do', '1996', 'In every life there comes a time when that thing you dream becomes that thing you do\\r')\n",
      "('Joe Versus the Volcano', '1990', '\"A story of love')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('That Thing You Do', '1996', 'In every life there comes a time when that thing you dream becomes that thing you do\\r')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "(\"You've Got Mail\", '1998', 'At odds in life... in love on-line.\\r')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('Sleepless in Seattle', '1993', '\"What if someone you never met')\n",
      "('Joe Versus the Volcano', '1990', '\"A story of love')\n",
      "('The Birdcage', '1996', 'Come as you are\\r')\n",
      "('Joe Versus the Volcano', '1990', '\"A story of love')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('When Harry Met Sally', '1998', 'At odds in life... in love on-line.\\r')\n",
      "('That Thing You Do', '1996', 'In every life there comes a time when that thing you dream becomes that thing you do\\r')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('Unforgiven', '1992', '\"It\\'s a hell of a thing')\n",
      "('The Birdcage', '1996', 'Come as you are\\r')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('RescueDawn', '2006', \"Based on the extraordinary true story of one man's fight for freedom\\r\")\n",
      "('Twister', '1996', \"Don't Breathe. Don't Look Back.\\r\")\n",
      "('RescueDawn', '2006', \"Based on the extraordinary true story of one man's fight for freedom\\r\")\n",
      "(\"Charlie Wilson's War\", '2007', \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\\r\")\n",
      "('The Birdcage', '1996', 'Come as you are\\r')\n",
      "('Unforgiven', '1992', '\"It\\'s a hell of a thing')\n",
      "('Unforgiven', '1992', '\"It\\'s a hell of a thing')\n",
      "('Unforgiven', '1992', '\"It\\'s a hell of a thing')\n",
      "('Johnny Mnemonic', '1995', 'The hottest data on earth. In the coolest head in town\\r')\n",
      "('Johnny Mnemonic', '1995', 'The hottest data on earth. In the coolest head in town\\r')\n",
      "('Johnny Mnemonic', '1995', 'The hottest data on earth. In the coolest head in town\\r')\n",
      "('Johnny Mnemonic', '1995', 'The hottest data on earth. In the coolest head in town\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('V for Vendetta', '2006', 'Freedom! Forever!\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('Speed Racer', '2008', 'Speed has no limits\\r')\n",
      "('Ninja Assassin', '2009', 'Prepare to enter a secret world of assassins\\r')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('The Green Mile', '1999', \"Walk a mile you'll never forget.\\r\")\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "('Bicentennial Man', '1999', \"One robot's 200 year journey to become an ordinary man.\\r\")\n",
      "('Frost/Nixon', '2008', '400 million people were waiting for the truth.\\r')\n",
      "(\"One Flew Over the Cuckoo's Nest\", '1975', '\"If he\\'s crazy')\n",
      "('Hoffa', '1992', \"He didn't want law. He wanted justice.\\r\")\n",
      "('Hoffa', '1992', \"He didn't want law. He wanted justice.\\r\")\n",
      "('Hoffa', '1992', \"He didn't want law. He wanted justice.\\r\")\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('Twister', '1996', \"Don't Breathe. Don't Look Back.\\r\")\n",
      "('Apollo 13', '1995', '\"Houston')\n",
      "(\"Charlie Wilson's War\", '2007', \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\\r\")\n",
      "('Twister', '1996', \"Don't Breathe. Don't Look Back.\\r\")\n",
      "('Twister', '1996', \"Don't Breathe. Don't Look Back.\\r\")\n",
      "('The Polar Express', '2004', 'This Holiday Season… Believe\\r')\n",
      "('Cast Away', '2000', '\"At the edge of the world')\n",
      "(\"One Flew Over the Cuckoo's Nest\", '1975', '\"If he\\'s crazy')\n",
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "(\"Something's Gotta Give\", '1975', 'null\\r')\n",
      "('Bicentennial Man', '1999', \"One robot's 200 year journey to become an ordinary man.\\r\")\n",
      "(\"Charlie Wilson's War\", '2007', \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\\r\")\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('A League of Their Own', '1992', 'Once in a lifetime you get a chance to do something different.\\r')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('The Birdcage', '1996', 'Come as you are\\r')\n",
      "('Unforgiven', '1992', '\"It\\'s a hell of a thing')\n",
      "('The Replacements', '2000', '\"Pain heals')\n",
      "('Cloud Atlas', '2012', 'Everything is connected\\r')\n",
      "('The Da Vinci Code', '2006', 'Break The Codes\\r')\n",
      "('The Replacements', '2000', '\"Pain heals')\n"
     ]
    }
   ],
   "source": [
    "# SQL query consult\n",
    "query = f\"SELECT * FROM movies;\"\n",
    "result=query_sql(query)\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d6f22e0",
   "metadata": {},
   "source": [
    "## Dropping duplicate rows and joining tables by common movies\n",
    "Due that mySQL doesn't allow to export directly a table to a json file, it will be exported at first to a csv file, then it will be loaded as a pandas dataframe and finally, it will be exported as a Json file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "7c7e0cca",
   "metadata": {},
   "outputs": [],
   "source": [
    "# At first, three subqueries will return distincts rows from every table, then an inner join between these three.\n",
    "query = f'''WITH MOVIES AS (SELECT DISTINCT * FROM MOVIES),\n",
    "ACTORS AS (SELECT DISTINCT * FROM ACTORS),\n",
    "DIRECTORS AS (SELECT DISTINCT * FROM DIRECTORS)\n",
    "SELECT MOVIES.TITLE,MOVIES.RELEASED, ACTORS.ROLE,ACTORS.NAME AS ACTOR,DIRECTORS.NAME AS DIRECTOR FROM MOVIES \n",
    "INNER JOIN ACTORS ON MOVIES.TITLE = ACTORS.movie_title \n",
    "INNER JOIN DIRECTORS ON ACTORS.movie_title = DIRECTORS.movie_title \n",
    "INTO OUTFILE 'MOVIES_EXPORT.csv';\n",
    "'''         #The CSV resulting file will be exported to the same path than the project folder \n",
    "result=query_sql(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "id": "fd88b638",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Title</th>\n",
       "      <th>released</th>\n",
       "      <th>Role</th>\n",
       "      <th>Actor</th>\n",
       "      <th>Director</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Something's Gotta Give</td>\n",
       "      <td>1975</td>\n",
       "      <td>Julian Mercer</td>\n",
       "      <td>Keanu Reeves</td>\n",
       "      <td>Nancy Meyers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Something's Gotta Give</td>\n",
       "      <td>1975</td>\n",
       "      <td>Harry Sanborn</td>\n",
       "      <td>Jack Nicholson</td>\n",
       "      <td>Nancy Meyers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Something's Gotta Give</td>\n",
       "      <td>1975</td>\n",
       "      <td>Erica Barry</td>\n",
       "      <td>Diane Keaton</td>\n",
       "      <td>Nancy Meyers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Johnny Mnemonic</td>\n",
       "      <td>1995</td>\n",
       "      <td>Johnny Mnemonic</td>\n",
       "      <td>Keanu Reeves</td>\n",
       "      <td>Robert Longo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Johnny Mnemonic</td>\n",
       "      <td>1995</td>\n",
       "      <td>Takahashi</td>\n",
       "      <td>Takeshi Kitano</td>\n",
       "      <td>Robert Longo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>195</th>\n",
       "      <td>The Da Vinci Code</td>\n",
       "      <td>2006</td>\n",
       "      <td>Sophie Neveu</td>\n",
       "      <td>Audrey Tautou</td>\n",
       "      <td>Ron Howard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>196</th>\n",
       "      <td>The Da Vinci Code</td>\n",
       "      <td>2006</td>\n",
       "      <td>Silas</td>\n",
       "      <td>Paul Bettany</td>\n",
       "      <td>Ron Howard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>197</th>\n",
       "      <td>Unforgiven</td>\n",
       "      <td>1992</td>\n",
       "      <td>Little Bill Daggett</td>\n",
       "      <td>Gene Hackman</td>\n",
       "      <td>Clint Eastwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>198</th>\n",
       "      <td>Unforgiven</td>\n",
       "      <td>1992</td>\n",
       "      <td>English Bob</td>\n",
       "      <td>Richard Harris</td>\n",
       "      <td>Clint Eastwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>199</th>\n",
       "      <td>Unforgiven</td>\n",
       "      <td>1992</td>\n",
       "      <td>Bill Munny</td>\n",
       "      <td>Clint Eastwood</td>\n",
       "      <td>Clint Eastwood</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>200 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      Title  released                 Role           Actor  \\\n",
       "0    Something's Gotta Give      1975        Julian Mercer    Keanu Reeves   \n",
       "1    Something's Gotta Give      1975        Harry Sanborn  Jack Nicholson   \n",
       "2    Something's Gotta Give      1975          Erica Barry    Diane Keaton   \n",
       "3           Johnny Mnemonic      1995      Johnny Mnemonic    Keanu Reeves   \n",
       "4           Johnny Mnemonic      1995            Takahashi  Takeshi Kitano   \n",
       "..                      ...       ...                  ...             ...   \n",
       "195       The Da Vinci Code      2006         Sophie Neveu   Audrey Tautou   \n",
       "196       The Da Vinci Code      2006                Silas    Paul Bettany   \n",
       "197              Unforgiven      1992  Little Bill Daggett    Gene Hackman   \n",
       "198              Unforgiven      1992          English Bob  Richard Harris   \n",
       "199              Unforgiven      1992           Bill Munny  Clint Eastwood   \n",
       "\n",
       "           Director  \n",
       "0      Nancy Meyers  \n",
       "1      Nancy Meyers  \n",
       "2      Nancy Meyers  \n",
       "3      Robert Longo  \n",
       "4      Robert Longo  \n",
       "..              ...  \n",
       "195      Ron Howard  \n",
       "196      Ron Howard  \n",
       "197  Clint Eastwood  \n",
       "198  Clint Eastwood  \n",
       "199  Clint Eastwood  \n",
       "\n",
       "[200 rows x 5 columns]"
      ]
     },
     "execution_count": 162,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd                                           #Creating the pandas Data frame\n",
    "\n",
    "df=pd.read_csv(\"C:/xampp/mysql/data/nosql_projectext/MOVIES_EXPORT.csv\", sep=\"\\t\",encoding='utf-8', names= [\"Title\",\"released\",\"Role\",\"Actor\",\"Director\"])\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 168,
   "id": "aeb9bd80",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_json(\"movies_export.json\", orient= \"records\")           #Exporting the dataframe to a json file"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "673042bf",
   "metadata": {},
   "source": [
    "## Loading the movies_export.json file to mongoDB ATLAS server"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ffc5a12a",
   "metadata": {},
   "source": [
    "## Creating the database\n",
    "\n",
    "A new database is created in a mongoDB Atlas cluster to use the MongoDB Charts utility, as the previous case, we need to declare a client with the cluster URL, user and password"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 224,
   "id": "24aa4156",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\34666\\anaconda3\\lib\\site-packages\\cryptography\\x509\\base.py:521: CryptographyDeprecationWarning: Parsed a negative serial number, which is disallowed by RFC 5280.\n",
      "  return rust_x509.load_der_x509_certificate(data)\n"
     ]
    }
   ],
   "source": [
    "client = MongoClient('mongodb+srv://jmsanchezd91:4rYvn1gaptEcrXVG@cluster0.jtsy1tw.mongodb.net/')\n",
    "db = client[\"project_extension\"]\n",
    "movies = db[\"movies\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c80265c1",
   "metadata": {},
   "source": [
    "Once created the collection in the data base, we start the document's feeding using  first the same database used on the proposed exercises and the one contained in the recently exported json file ``movies_export.json``"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 225,
   "id": "4f61db7c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<pymongo.results.InsertManyResult at 0x250b435c760>"
      ]
     },
     "execution_count": 225,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies.insert_many([\n",
    "{\n",
    "\"title\" : \"Fight Club\",\n",
    "\"Writer\": \"Chuck Palahniuk\",\n",
    "\"Year\": 1999,\n",
    "\"actors\": [\"Brad Pitt\",\"Edward Norton\"]\n",
    "},\n",
    "{\n",
    "\"title\": \"Pulp Fiction\",\n",
    "\"writer\": \"Quentin Tarantino\",\n",
    "\"year\" : 1994,\n",
    "\"actors\" : [\"John Travolta\",\"Uma Thurman\"]\n",
    "},\n",
    "{\n",
    "\"title\" : \"Inglorious Basterds\",\n",
    "\"writer\": \"Quentin Tarantino\",\n",
    "\"year\" : 2009,\n",
    "\"actors\" : [\"Brad Pitt\",\"Diane Kruger\",\"Eli Roth\"]\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: An Unexpected Journey\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2012,\n",
    "\"franchise\" : \"The Hobbit\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: The Desolation of Smaug\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2013,\n",
    "\"franchise\" : \"The Hobbit\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"The Hobbit: The Battle of the Five Armies\",\n",
    "\"writer\" : \"J.R.R. Tolkien\",\n",
    "\"year\" : 2012,\n",
    "\"franchise\" : \"The Hobbit\",\n",
    "\"Synopsis\": \"Bilbo and Company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness.\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"Pee Wee Herman's Big Adventure\"\n",
    "},\n",
    "{\n",
    "\"title\" : \"Avatar\"\n",
    "}\n",
    "])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "55d47051",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'Title': \"Something's Gotta Give\", 'released': 1975, 'Role': 'Julian Mercer', 'Actor': 'Keanu Reeves', 'Director': 'Nancy Meyers'}, {'Title': \"Something's Gotta Give\", 'released': 1975, 'Role': 'Harry Sanborn', 'Actor': 'Jack Nicholson', 'Director': 'Nancy Meyers'}, {'Title': \"Something's Gotta Give\", 'released': 1975, 'Role': 'Erica Barry', 'Actor': 'Diane Keaton', 'Director': 'Nancy Meyers'}, {'Title': 'Johnny Mnemonic', 'released': 1995, 'Role': 'Johnny Mnemonic', 'Actor': 'Keanu Reeves', 'Director': 'Robert Longo'}, {'Title': 'Johnny Mnemonic', 'released': 1995, 'Role': 'Takahashi', 'Actor': 'Takeshi Kitano', 'Director': 'Robert Longo'}, {'Title': 'Johnny Mnemonic', 'released': 1995, 'Role': 'Jane', 'Actor': 'Dina Meyer', 'Director': 'Robert Longo'}, {'Title': 'Johnny Mnemonic', 'released': 1995, 'Role': 'J-Bone', 'Actor': 'Ice-T', 'Director': 'Robert Longo'}, {'Title': 'The Replacements', 'released': 2000, 'Role': 'Shane Falco', 'Actor': 'Keanu Reeves', 'Director': 'Howard Deutch'}, {'Title': 'The Replacements', 'released': 2000, 'Role': 'Annabelle Farrell', 'Actor': 'Brooke Langton', 'Director': 'Howard Deutch'}, {'Title': 'The Replacements', 'released': 2000, 'Role': 'Jimmy McGinty', 'Actor': 'Gene Hackman', 'Director': 'Howard Deutch'}, {'Title': 'The Replacements', 'released': 2000, 'Role': 'Clifford Franklin', 'Actor': 'Orlando Jones', 'Director': 'Howard Deutch'}, {'Title': \"The Devil's Advocate\", 'released': 1997, 'Role': 'Kevin Lomax', 'Actor': 'Keanu Reeves', 'Director': 'Taylor Hackford'}, {'Title': \"The Devil's Advocate\", 'released': 1997, 'Role': 'Mary Ann Lomax', 'Actor': 'Charlize Theron', 'Director': 'Taylor Hackford'}, {'Title': \"The Devil's Advocate\", 'released': 1997, 'Role': 'John Milton', 'Actor': 'Al Pacino', 'Director': 'Taylor Hackford'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Revolutions', 'released': 2003, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix Reloaded', 'released': 2003, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Neo', 'Actor': 'Keanu Reeves', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Trinity', 'Actor': 'Carrie-Anne Moss', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Morpheus', 'Actor': 'Laurence Fishburne', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Agent Smith', 'Actor': 'Hugo Weaving', 'Director': 'Lana Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Emil', 'Actor': 'Emil Eifrem', 'Director': 'Andy Wachowski'}, {'Title': 'The Matrix', 'released': 1999, 'Role': 'Emil', 'Actor': 'Emil Eifrem', 'Director': 'Lana Wachowski'}, {'Title': 'V for Vendetta', 'released': 2006, 'Role': 'V', 'Actor': 'Hugo Weaving', 'Director': 'James Marshall'}, {'Title': 'V for Vendetta', 'released': 2006, 'Role': 'Evey Hammond', 'Actor': 'Natalie Portman', 'Director': 'James Marshall'}, {'Title': 'V for Vendetta', 'released': 2006, 'Role': 'Eric Finch', 'Actor': 'Stephen Rea', 'Director': 'James Marshall'}, {'Title': 'V for Vendetta', 'released': 2006, 'Role': 'High Chancellor Adam Sutler', 'Actor': 'John Hurt', 'Director': 'James Marshall'}, {'Title': 'V for Vendetta', 'released': 2006, 'Role': 'Dascomb', 'Actor': 'Ben Miles', 'Director': 'James Marshall'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Bill Smoke;Haskell Moore;Tadeusz Kesselring;Nurse Noakes;Boardman Mephi;Old Georgie', 'Actor': 'Hugo Weaving', 'Director': 'Andy Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Bill Smoke;Haskell Moore;Tadeusz Kesselring;Nurse Noakes;Boardman Mephi;Old Georgie', 'Actor': 'Hugo Weaving', 'Director': 'Lana Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Bill Smoke;Haskell Moore;Tadeusz Kesselring;Nurse Noakes;Boardman Mephi;Old Georgie', 'Actor': 'Hugo Weaving', 'Director': 'Tom Tykwer'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Zachry;Dr. Henry Goose;Isaac Sachs;Dermot Hoggins', 'Actor': 'Tom Hanks', 'Director': 'Andy Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Zachry;Dr. Henry Goose;Isaac Sachs;Dermot Hoggins', 'Actor': 'Tom Hanks', 'Director': 'Lana Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Zachry;Dr. Henry Goose;Isaac Sachs;Dermot Hoggins', 'Actor': 'Tom Hanks', 'Director': 'Tom Tykwer'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Luisa Rey;Jocasta Ayrs;Ovid;Meronym', 'Actor': 'Halle Berry', 'Director': 'Andy Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Luisa Rey;Jocasta Ayrs;Ovid;Meronym', 'Actor': 'Halle Berry', 'Director': 'Lana Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Luisa Rey;Jocasta Ayrs;Ovid;Meronym', 'Actor': 'Halle Berry', 'Director': 'Tom Tykwer'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Vyvyan Ayrs;Captain Molyneux;Timothy Cavendish', 'Actor': 'Jim Broadbent', 'Director': 'Andy Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Vyvyan Ayrs;Captain Molyneux;Timothy Cavendish', 'Actor': 'Jim Broadbent', 'Director': 'Lana Wachowski'}, {'Title': 'Cloud Atlas', 'released': 2012, 'Role': 'Vyvyan Ayrs;Captain Molyneux;Timothy Cavendish', 'Actor': 'Jim Broadbent', 'Director': 'Tom Tykwer'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Cass Jones', 'Actor': 'Ben Miles', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Cass Jones', 'Actor': 'Ben Miles', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Speed Racer', 'Actor': 'Emile Hirsch', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Speed Racer', 'Actor': 'Emile Hirsch', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Pops', 'Actor': 'John Goodman', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Pops', 'Actor': 'John Goodman', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Mom', 'Actor': 'Susan Sarandon', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Mom', 'Actor': 'Susan Sarandon', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Racer X', 'Actor': 'Matthew Fox', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Racer X', 'Actor': 'Matthew Fox', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Trixie', 'Actor': 'Christina Ricci', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Trixie', 'Actor': 'Christina Ricci', 'Director': 'Lana Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Taejo Togokahn', 'Actor': 'Rain', 'Director': 'Andy Wachowski'}, {'Title': 'Speed Racer', 'released': 2008, 'Role': 'Taejo Togokahn', 'Actor': 'Rain', 'Director': 'Lana Wachowski'}, {'Title': 'Ninja Assassin', 'released': 2009, 'Role': 'Takeshi', 'Actor': 'Rick Yune', 'Director': 'James Marshall'}, {'Title': 'Ninja Assassin', 'released': 2009, 'Role': 'Ryan Maslow', 'Actor': 'Ben Miles', 'Director': 'James Marshall'}, {'Title': 'Ninja Assassin', 'released': 2009, 'Role': 'Raizo', 'Actor': 'Rain', 'Director': 'James Marshall'}, {'Title': 'Ninja Assassin', 'released': 2009, 'Role': 'Mika Coretti', 'Actor': 'Naomie Harris', 'Director': 'James Marshall'}, {'Title': 'That Thing You Do', 'released': 1996, 'Role': 'Tina', 'Actor': 'Charlize Theron', 'Director': 'Tom Hanks'}, {'Title': 'That Thing You Do', 'released': 1996, 'Role': 'Mr. White', 'Actor': 'Tom Hanks', 'Director': 'Tom Hanks'}, {'Title': 'That Thing You Do', 'released': 1996, 'Role': 'Faye Dolan', 'Actor': 'Liv Tyler', 'Director': 'Tom Hanks'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Jerry Maguire', 'Actor': 'Tom Cruise', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Rod Tidwell', 'Actor': 'Cuba Gooding Jr.', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Dorothy Boyd', 'Actor': 'Renee Zellweger', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Avery Bishop', 'Actor': 'Kelly Preston', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Frank Cushman', 'Actor': \"Jerry O'Connell\", 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Bob Sugar', 'Actor': 'Jay Mohr', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Laurel Boyd', 'Actor': 'Bonnie Hunt', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Marcee Tidwell', 'Actor': 'Regina King', 'Director': 'Cameron Crowe'}, {'Title': 'Jerry Maguire', 'released': 2000, 'Role': 'Ray Boyd', 'Actor': 'Jonathan Lipnicki', 'Director': 'Cameron Crowe'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Maverick', 'Actor': 'Tom Cruise', 'Director': 'Tony Scott'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Charlie', 'Actor': 'Kelly McGillis', 'Director': 'Tony Scott'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Iceman', 'Actor': 'Val Kilmer', 'Director': 'Tony Scott'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Goose', 'Actor': 'Anthony Edwards', 'Director': 'Tony Scott'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Viper', 'Actor': 'Tom Skerritt', 'Director': 'Tony Scott'}, {'Title': 'Top Gun', 'released': 1986, 'Role': 'Carole', 'Actor': 'Meg Ryan', 'Director': 'Tony Scott'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Lt. Daniel Kaffee', 'Actor': 'Tom Cruise', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Col. Nathan R. Jessup', 'Actor': 'Jack Nicholson', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Lt. Cdr. JoAnne Galloway', 'Actor': 'Demi Moore', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Capt. Jack Ross', 'Actor': 'Kevin Bacon', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Lt. Jonathan Kendrick', 'Actor': 'Kiefer Sutherland', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Cpl. Jeffrey Barnes', 'Actor': 'Noah Wyle', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Cpl. Carl Hammaker', 'Actor': 'Cuba Gooding Jr.', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Lt. Sam Weinberg', 'Actor': 'Kevin Pollak', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Lt. Col. Matthew Andrew Markinson', 'Actor': 'J.T. Walsh', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Pfc. Louden Downey', 'Actor': 'James Marshall', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Dr. Stone', 'Actor': 'Christopher Guest', 'Director': 'Rob Reiner'}, {'Title': 'A Few Good Men', 'released': 1992, 'Role': 'Man in Bar', 'Actor': 'Aaron Sorkin', 'Director': 'Rob Reiner'}, {'Title': \"One Flew Over the Cuckoo's Nest\", 'released': 1975, 'Role': 'Randle McMurphy', 'Actor': 'Jack Nicholson', 'Director': 'Milos Forman'}, {'Title': \"One Flew Over the Cuckoo's Nest\", 'released': 1975, 'Role': 'Martini', 'Actor': 'Danny DeVito', 'Director': 'Milos Forman'}, {'Title': 'Hoffa', 'released': 1992, 'Role': 'Hoffa', 'Actor': 'Jack Nicholson', 'Director': 'Danny DeVito'}, {'Title': 'Hoffa', 'released': 1992, 'Role': 'Frank Fitzsimmons', 'Actor': 'J.T. Walsh', 'Director': 'Danny DeVito'}, {'Title': 'Hoffa', 'released': 1992, 'Role': \"Robert 'Bobby' Ciaro\", 'Actor': 'Danny DeVito', 'Director': 'Danny DeVito'}, {'Title': 'Hoffa', 'released': 1992, 'Role': \"Peter 'Pete' Connelly\", 'Actor': 'John C. Reilly', 'Director': 'Danny DeVito'}, {'Title': 'As Good as It Gets', 'released': 1997, 'Role': 'Melvin Udall', 'Actor': 'Jack Nicholson', 'Director': 'James L. Brooks'}, {'Title': 'As Good as It Gets', 'released': 1997, 'Role': 'Frank Sachs', 'Actor': 'Cuba Gooding Jr.', 'Director': 'James L. Brooks'}, {'Title': 'As Good as It Gets', 'released': 1997, 'Role': 'Carol Connelly', 'Actor': 'Helen Hunt', 'Director': 'James L. Brooks'}, {'Title': 'As Good as It Gets', 'released': 1997, 'Role': 'Simon Bishop', 'Actor': 'Greg Kinnear', 'Director': 'James L. Brooks'}, {'Title': 'Apollo 13', 'released': 1995, 'Role': 'Jack Swigert', 'Actor': 'Kevin Bacon', 'Director': 'Ron Howard'}, {'Title': 'Apollo 13', 'released': 1995, 'Role': 'Jim Lovell', 'Actor': 'Tom Hanks', 'Director': 'Ron Howard'}, {'Title': 'Apollo 13', 'released': 1995, 'Role': 'Ken Mattingly', 'Actor': 'Gary Sinise', 'Director': 'Ron Howard'}, {'Title': 'Apollo 13', 'released': 1995, 'Role': 'Gene Kranz', 'Actor': 'Ed Harris', 'Director': 'Ron Howard'}, {'Title': 'Apollo 13', 'released': 1995, 'Role': 'Fred Haise', 'Actor': 'Bill Paxton', 'Director': 'Ron Howard'}, {'Title': 'Frost/Nixon', 'released': 2008, 'Role': 'Jack Brennan', 'Actor': 'Kevin Bacon', 'Director': 'Ron Howard'}, {'Title': 'Frost/Nixon', 'released': 2008, 'Role': 'James Reston', 'Actor': ' Jr.', 'Director': 'Ron Howard'}, {'Title': 'Frost/Nixon', 'released': 2008, 'Role': 'Richard Nixon', 'Actor': 'Frank Langella', 'Director': 'Ron Howard'}, {'Title': 'Frost/Nixon', 'released': 2008, 'Role': 'David Frost', 'Actor': 'Michael Sheen', 'Director': 'Ron Howard'}, {'Title': 'Frost/Nixon', 'released': 2008, 'Role': 'Bob Zelnick', 'Actor': 'Oliver Platt', 'Director': 'Ron Howard'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Ace Merrill', 'Actor': 'Kiefer Sutherland', 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Vern Tessio', 'Actor': \"Jerry O'Connell\", 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Chris Chambers', 'Actor': 'River Phoenix', 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Teddy Duchamp', 'Actor': 'Corey Feldman', 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Gordie Lachance', 'Actor': 'Wil Wheaton', 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Denny Lachance', 'Actor': 'John Cusack', 'Director': 'Rob Reiner'}, {'Title': 'Stand By Me', 'released': 1995, 'Role': 'Mr. Lachance', 'Actor': 'Marshall Bell', 'Director': 'Rob Reiner'}, {'Title': 'What Dreams May Come', 'released': 1998, 'Role': 'Albert Lewis', 'Actor': 'Cuba Gooding Jr.', 'Director': 'Vincent Ward'}, {'Title': 'What Dreams May Come', 'released': 1998, 'Role': 'Simon Bishop', 'Actor': 'Annabella Sciorra', 'Director': 'Vincent Ward'}, {'Title': 'What Dreams May Come', 'released': 1998, 'Role': 'The Tracker', 'Actor': 'Max von Sydow', 'Director': 'Vincent Ward'}, {'Title': 'What Dreams May Come', 'released': 1998, 'Role': 'The Face', 'Actor': 'Werner Herzog', 'Director': 'Vincent Ward'}, {'Title': 'What Dreams May Come', 'released': 1998, 'Role': 'Chris Nielsen', 'Actor': 'Robin Williams', 'Director': 'Vincent Ward'}, {'Title': 'When Harry Met Sally', 'released': 1998, 'Role': 'Sally Albright', 'Actor': 'Meg Ryan', 'Director': 'Rob Reiner'}, {'Title': 'When Harry Met Sally', 'released': 1998, 'Role': 'Harry Burns', 'Actor': 'Billy Crystal', 'Director': 'Rob Reiner'}, {'Title': 'When Harry Met Sally', 'released': 1998, 'Role': 'Marie', 'Actor': 'Carrie Fisher', 'Director': 'Rob Reiner'}, {'Title': 'When Harry Met Sally', 'released': 1998, 'Role': 'Jess', 'Actor': 'Bruno Kirby', 'Director': 'Rob Reiner'}, {'Title': 'Joe Versus the Volcano', 'released': 1990, 'Role': 'DeDe;Angelica Graynamore;Patricia Graynamore', 'Actor': 'Meg Ryan', 'Director': 'John Patrick Stanley'}, {'Title': 'Joe Versus the Volcano', 'released': 1990, 'Role': 'Joe Banks', 'Actor': 'Tom Hanks', 'Director': 'John Patrick Stanley'}, {'Title': 'Joe Versus the Volcano', 'released': 1990, 'Role': 'Baw', 'Actor': 'Nathan Lane', 'Director': 'John Patrick Stanley'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Annie Reed', 'Actor': 'Meg Ryan', 'Director': 'Nora Ephron'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Sam Baldwin', 'Actor': 'Tom Hanks', 'Director': 'Nora Ephron'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Suzy', 'Actor': 'Rita Wilson', 'Director': 'Nora Ephron'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Walter', 'Actor': 'Bill Pullman', 'Director': 'Nora Ephron'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Greg', 'Actor': 'Victor Garber', 'Director': 'Nora Ephron'}, {'Title': 'Sleepless in Seattle', 'released': 1993, 'Role': 'Becky', 'Actor': \"Rosie O'Donnell\", 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'Kathleen Kelly', 'Actor': 'Meg Ryan', 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'Frank Navasky', 'Actor': 'Greg Kinnear', 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'Patricia Eden', 'Actor': 'Parker Posey', 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'Kevin Jackson', 'Actor': 'Dave Chappelle', 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'George Pappas', 'Actor': 'Steve Zahn', 'Director': 'Nora Ephron'}, {'Title': \"You've Got Mail\", 'released': 1998, 'Role': 'Joe Fox', 'Actor': 'Tom Hanks', 'Director': 'Nora Ephron'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'Jan Edgecomb', 'Actor': 'Bonnie Hunt', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'Warden Hal Moores', 'Actor': 'James Cromwell', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'Paul Edgecomb', 'Actor': 'Tom Hanks', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'John Coffey', 'Actor': 'Michael Clarke Duncan', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': \"Brutus 'Brutal' Howell\", 'Actor': 'David Morse', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': \"'Wild Bill' Wharton\", 'Actor': 'Sam Rockwell', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'Burt Hammersmith', 'Actor': 'Gary Sinise', 'Director': 'Frank Darabont'}, {'Title': 'The Green Mile', 'released': 1999, 'Role': 'Melinda Moores', 'Actor': 'Patricia Clarkson', 'Director': 'Frank Darabont'}, {'Title': 'RescueDawn', 'released': 2006, 'Role': 'Admiral', 'Actor': 'Marshall Bell', 'Director': 'Werner Herzog'}, {'Title': 'RescueDawn', 'released': 2006, 'Role': 'Duane', 'Actor': 'Steve Zahn', 'Director': 'Werner Herzog'}, {'Title': 'RescueDawn', 'released': 2006, 'Role': 'Dieter Dengler', 'Actor': 'Christian Bale', 'Director': 'Werner Herzog'}, {'Title': 'RescueDawn', 'released': 2006, 'Role': 'Squad Leader', 'Actor': 'Zach Grenier', 'Director': 'Werner Herzog'}, {'Title': 'Cast Away', 'released': 2000, 'Role': 'Kelly Frears', 'Actor': 'Helen Hunt', 'Director': 'Robert Zemeckis'}, {'Title': 'Cast Away', 'released': 2000, 'Role': 'Chuck Noland', 'Actor': 'Tom Hanks', 'Director': 'Robert Zemeckis'}, {'Title': 'Twister', 'released': 1996, 'Role': 'Dr. Jo Harding', 'Actor': 'Helen Hunt', 'Director': 'Jan de Bont'}, {'Title': 'Twister', 'released': 1996, 'Role': 'Eddie', 'Actor': 'Zach Grenier', 'Director': 'Jan de Bont'}, {'Title': 'Twister', 'released': 1996, 'Role': 'Bill Harding', 'Actor': 'Bill Paxton', 'Director': 'Jan de Bont'}, {'Title': 'Twister', 'released': 1996, 'Role': \"Dustin 'Dusty' Davis\", 'Actor': 'Philip Seymour Hoffman', 'Director': 'Jan de Bont'}, {'Title': 'Snow Falling on Cedars', 'released': 1999, 'Role': 'Nels Gudmundsson', 'Actor': 'Max von Sydow', 'Director': 'Scott Hicks'}, {'Title': 'Snow Falling on Cedars', 'released': 1999, 'Role': 'Ishmael Chambers', 'Actor': 'Ethan Hawke', 'Director': 'Scott Hicks'}, {'Title': 'Snow Falling on Cedars', 'released': 1999, 'Role': 'Kazuo Miyamoto', 'Actor': 'Rick Yune', 'Director': 'Scott Hicks'}, {'Title': 'Snow Falling on Cedars', 'released': 1999, 'Role': 'Judge Fielding', 'Actor': 'James Cromwell', 'Director': 'Scott Hicks'}, {'Title': 'Bicentennial Man', 'released': 1999, 'Role': 'Andrew Marin', 'Actor': 'Robin Williams', 'Director': 'Chris Columbus'}, {'Title': 'Bicentennial Man', 'released': 1999, 'Role': 'Rupert Burns', 'Actor': 'Oliver Platt', 'Director': 'Chris Columbus'}, {'Title': 'The Birdcage', 'released': 1996, 'Role': 'Armand Goldman', 'Actor': 'Robin Williams', 'Director': 'Mike Nichols'}, {'Title': 'The Birdcage', 'released': 1996, 'Role': 'Albert Goldman', 'Actor': 'Nathan Lane', 'Director': 'Mike Nichols'}, {'Title': 'The Birdcage', 'released': 1996, 'Role': 'Sen. Kevin Keeley', 'Actor': 'Gene Hackman', 'Director': 'Mike Nichols'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': 'Jimmy Dugan', 'Actor': 'Tom Hanks', 'Director': 'Penny Marshall'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': 'Doris Murphy', 'Actor': \"Rosie O'Donnell\", 'Director': 'Penny Marshall'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': 'Bob Hinson', 'Actor': 'Bill Paxton', 'Director': 'Penny Marshall'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': \"'All the Way' Mae Mordabito\", 'Actor': 'Madonna', 'Director': 'Penny Marshall'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': 'Dottie Hinson', 'Actor': 'Geena Davis', 'Director': 'Penny Marshall'}, {'Title': 'A League of Their Own', 'released': 1992, 'Role': 'Kit Keller', 'Actor': 'Lori Petty', 'Director': 'Penny Marshall'}, {'Title': 'The Polar Express', 'released': 2004, 'Role': 'Hero Boy;Father;Conductor;Hobo;Scrooge;Santa Claus', 'Actor': 'Tom Hanks', 'Director': 'Robert Zemeckis'}, {'Title': \"Charlie Wilson's War\", 'released': 2007, 'Role': 'Rep. Charlie Wilson', 'Actor': 'Tom Hanks', 'Director': 'Mike Nichols'}, {'Title': \"Charlie Wilson's War\", 'released': 2007, 'Role': 'Gust Avrakotos', 'Actor': 'Philip Seymour Hoffman', 'Director': 'Mike Nichols'}, {'Title': \"Charlie Wilson's War\", 'released': 2007, 'Role': 'Joanne Herring', 'Actor': 'Julia Roberts', 'Director': 'Mike Nichols'}, {'Title': 'The Da Vinci Code', 'released': 2006, 'Role': 'Dr. Robert Langdon', 'Actor': 'Tom Hanks', 'Director': 'Ron Howard'}, {'Title': 'The Da Vinci Code', 'released': 2006, 'Role': 'Sir Leight Teabing', 'Actor': 'Ian McKellen', 'Director': 'Ron Howard'}, {'Title': 'The Da Vinci Code', 'released': 2006, 'Role': 'Sophie Neveu', 'Actor': 'Audrey Tautou', 'Director': 'Ron Howard'}, {'Title': 'The Da Vinci Code', 'released': 2006, 'Role': 'Silas', 'Actor': 'Paul Bettany', 'Director': 'Ron Howard'}, {'Title': 'Unforgiven', 'released': 1992, 'Role': 'Little Bill Daggett', 'Actor': 'Gene Hackman', 'Director': 'Clint Eastwood'}, {'Title': 'Unforgiven', 'released': 1992, 'Role': 'English Bob', 'Actor': 'Richard Harris', 'Director': 'Clint Eastwood'}, {'Title': 'Unforgiven', 'released': 1992, 'Role': 'Bill Munny', 'Actor': 'Clint Eastwood', 'Director': 'Clint Eastwood'}]\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "f1= open(\"C:/Users/34666/Master Data Scientist/Modulo III/NoSQL Individual Project/movies_export.json\",\"r\", encoding='utf-8')\n",
    "myDict = json.load(f1)\n",
    "f1.close()\n",
    "# for i in myDict:\n",
    "#     print(i)\n",
    "print(myDict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 226,
   "id": "fd80227d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<pymongo.results.InsertManyResult at 0x250b1d27b50>"
      ]
     },
     "execution_count": 226,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies.insert_many(myDict)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fa2bdcec",
   "metadata": {},
   "source": [
    "## Displaying data through mongo charts"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "450ee6b9",
   "metadata": {},
   "source": [
    "After the successful data load, we get the issue (as in the previous case) of some fields containing the same kind of information but with different field names, so it must be renamed to be correctly handled on the next queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 228,
   "id": "5dde2da8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<pymongo.results.UpdateResult at 0x250b1594970>"
      ]
     },
     "execution_count": 228,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies.update_many( {}, { \"$rename\": { \"actors\": \"Actor\", \"title\":\"Title\", \"released\":\"year\" } })"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "670cd97c",
   "metadata": {},
   "source": [
    "Once the collection has gotten completely prepared, through the mongoDB Charts utilities the following information is displayed:\n",
    "\n",
    "(to improve the visualization experience and provide more interactivity, follow the link:\n",
    "\n",
    "https://charts.mongodb.com/charts-project-0-xhjqj/public/dashboards/2d3225a4-53f1-4753-917a-2f998533ad04)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74f87244",
   "metadata": {},
   "source": [
    "<img width=200 style=\"float: left;\" src=\"Imagenes/Total entries on data base.png\">,\n",
    "<img width=250 style=\"float: center;\" src=\"Imagenes/Different directors founded in records.png\">,\n",
    "<img width=400 style=\"float: center;\" src=\"Imagenes/Null values on Directors field.png\">,\n",
    "<img width=300 style=\"float: left;\" src=\"Imagenes/Null values on released years field.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09672c93",
   "metadata": {},
   "source": [
    "In total we got 208 entries successfully loaded to our collection, with the following fields:\n",
    "\n",
    "- Internal MongoDB ID\n",
    "- Movie title\n",
    "- Year released\n",
    "- Role name and the actor who interpreted\n",
    "- Director\n",
    "- Writer\n",
    "- Franchise\n",
    "\n",
    "\n",
    "In which we find that the movie title has no null values, and group some rows with the same info and just some fields changing, so it could act as a pseudo-ID.\n",
    "\n",
    "Additionally we got that the field `Directors` has 28 different values in the whole entries and a minor proportion some null values, so it could work to label, categorize or group the documents\n",
    "\n",
    "Also the field year showed a minor proportion of null values, that make them could work to group fields."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7fae3592",
   "metadata": {},
   "source": [
    "<img width=250 style=\"float: left;\" src=\"Imagenes/Distincts movie titles founded on dataset.png\">,\n",
    "\n",
    "\n",
    "<img width=750 src=\"Imagenes/Multiplied titles due to exportation issues.png\">\n",
    "\n",
    "Is to note that the Movie titles field has 46 different unique values on the whole collection, this is due that on the SQL exportation way (from where the data is provided), each field had a single value, so if we have many actors (as usually happens) or directors per movie, the movie title will be repeated in different documents the same time as  the number of actors and directors this movie has.\n",
    "\n",
    "Graphically, we see how for the same movies (at the left side of the bar chart) the movie title is repeated  according to each color presented in each bar (each color represent a unique actor-director pair).\n",
    "\n",
    "In this way, in order to remark the data behavior of each different movie, the ``movie title`` could act as a grouping field"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "881568af",
   "metadata": {},
   "source": [
    "Keeping going with the data-behavior observation, let's start with some cross relational graphics:\n",
    "\n",
    "<img width=750 src=\"Imagenes/Number of movies per director over the decades.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "03891fb3",
   "metadata": {},
   "source": [
    "To start, we got that the main occurrence of movie release in our database is in range from 90's to 2010 and just 7 from the 28 directors have worked in more than one movie.\n",
    "Also, from 2010 on going the null Director values represent near to the half of the data, as it's showed at the down right corner of the graph."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "66ad419a",
   "metadata": {},
   "source": [
    "<img width=750 src=\"Imagenes/Actors - Directors coincidence correlation.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e5079da",
   "metadata": {},
   "source": [
    "In order to find the existence of a correlation between actors and directors, a heat map of coincidences between directors and actors on the same document is displayed, showing the choising preferences of some directors to work with determinated actors (just like the case of tom Hanks with some directors at the left side of the graphic) but even, this correlation can reveal the existence of movies franchises if we complement with other information like actor name, role interpreted and releasing years, such as the case of matrix (easy to note due the small extension of our database), evidentiated by the occurrence of some actors with directors Andy and Lana Wachowski."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "65b41fa3",
   "metadata": {},
   "source": [
    "# Conclusions and recommendations"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a337a6ab",
   "metadata": {},
   "source": [
    "After the performance of consults throug python drivers to MongoDB, Neo4j and MySQL, we could comment that:\n",
    "\n",
    "- The use of the Jupyter drivers of this notebook to connect to the mentioned apps, truly improve the interaction of the queries outputs but pauperize the output visualization\n",
    "- To export directly SQL tables like data to a Json files will repeat the principal fields on many rows\n",
    "- The Pymongo sytax varies lightly from the standard mongoDB syntax\n",
    "\n",
    "For further surveys:\n",
    "\n",
    "- When we have SQL like tables to export to json formatted files, is better first manage the secondary(information) fields when it be convenient to get a single collection with an arraid document\n",
    "- Try with py2neo driver to connect Jupyter and Neo4j and try to get a better graphos visualization\n",
    "- MongoDB Chart is a really attractive tool to present resulting graphics, try to get a way to present it from Jupyter or any other central notebook"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
